src/Documents/ВозвратИнвентаря.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>ВозвратИнвентаря</Name>
			<BasedOn>
				<xr:Item>Document.ВыдачаИнвентаря</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.ИнвентарьУСотрудников</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументОснование</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ВыдачаИнвентаря</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Позиции</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Инвентарь</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Инвентарь</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Состояние</Name>
							<Type>
								<v8:Type>cfg:EnumRef.СостоянияИнвентаря</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

src/AccumulationRegisters/ИнвентарьУСотрудников.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<AccumulationRegister>
		<Properties>
			<Name>ИнвентарьУСотрудников</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Инвентарь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Инвентарь</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

src/Enums/СостоянияИнвентаря.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>СостоянияИнвентаря</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Исправен</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ТребуетРемонта</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Утрачен</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/Documents/ВозвратИнвентаря/Forms/ФормаДокумента/Ext/Form/Module.bsl
&НаКлиенте
Процедура ЗаполнитьПоОстаткам(Команда)

    Если НЕ ЗначениеЗаполнено(Объект.Сотрудник) Тогда
        Сообщение = Новый СообщениеПользователю;
        Сообщение.Текст = "Сначала выберите сотрудника";
        Сообщение.Поле  = "Объект.Сотрудник";
        Сообщение.Сообщить();
        Возврат;
    КонецЕсли;

    ЗаполнитьПоОстаткамНаСервере();

КонецПроцедуры

&НаСервере
Процедура ЗаполнитьПоОстаткамНаСервере()

    ТаблицаОстатков = ОстаткиСотрудника(Объект.Сотрудник, Объект.Дата);

    Объект.Позиции.Очистить();
    Для Каждого СтрокаОстатка Из ТаблицаОстатков Цикл
        НоваяСтрока = Объект.Позиции.Добавить();
        НоваяСтрока.Инвентарь  = СтрокаОстатка.Инвентарь;
        НоваяСтрока.Количество = СтрокаОстатка.Остаток;
        НоваяСтрока.Состояние  = Перечисления.СостоянияИнвентаря.Исправен;
    КонецЦикла;

КонецПроцедуры

&НаСервереБезКонтекста
Функция ОстаткиСотрудника(Сотрудник, ДатаОстатков)

    Запрос = Новый Запрос;
    Запрос.Текст =
        "ВЫБРАТЬ
        |    Остатки.Инвентарь         КАК Инвентарь,
        |    Остатки.КоличествоОстаток КАК Остаток
        |ИЗ
        |    РегистрНакопления.ИнвентарьУСотрудников.Остатки(
        |        &ДатаОстатков,
        |        Сотрудник = &Сотрудник) КАК Остатки
        |ГДЕ
        |    Остатки.КоличествоОстаток > 0
        |УПОРЯДОЧИТЬ ПО
        |    Остатки.Инвентарь";

    Запрос.УстановитьПараметр("Сотрудник",    Сотрудник);
    Запрос.УстановитьПараметр("ДатаОстатков", ?(ЗначениеЗаполнено(ДатаОстатков),
                                                    ДатаОстатков, ТекущаяДатаСеанса()));

    Возврат Запрос.Выполнить().Выгрузить();

КонецФункции
